{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v1.7.4", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv2d_45/kernel", "shape": [4, 4, 3, 32], "dtype": "float32"}, {"name": "conv2d_45/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_46/kernel", "shape": [3, 3, 32, 16], "dtype": "float32"}, {"name": "conv2d_46/bias", "shape": [16], "dtype": "float32"}, {"name": "dense_45/kernel", "shape": [1024, 200], "dtype": "float32"}, {"name": "dense_45/bias", "shape": [200], "dtype": "float32"}, {"name": "dense_46/kernel", "shape": [200, 5], "dtype": "float32"}, {"name": "dense_46/bias", "shape": [5], "dtype": "float32"}]}]}